'''
# 나선형 (바깥 -> 안, 달팽이) 앞으로 가다가 막히면 오른쪽으로 꺾기

예:
   0  1  2  3  4
  15 16 17 18  5
  14 23 24 19  6
  13 22 21 20  7
  12 11 10  9  8
'''

def spiral_in(n):
    sdr, sdc = [0, 1, 0, -1], [1, 0, -1, 0]     # 우하좌상, 동남서북
    order = [[-1] * n for _ in range(n)]
    r = c = d = 0
    for i in range(n * n):
        order[r][c] = i
        nr, nc = r + sdr[d], c + sdc[d]
        # 범위를 벗어났거나 order가 -1인 경우면 방향 바꾸기
        if not (0 <= nr < n and 0 <= nc < n) or order[nr][nc] != -1:
            d = (d + 1) % 4
            nr, nc = r + sdr[d], c + sdc[d]
        r, c = nr, nc

'''
# 나선형 (가운데 -> 바깥, 토네이도) 이동 길이 1, 1, 2, 2, 3, 3 ...
# 방향을 바꾸기 전까지를 하나의 구간이라고 하면, 각 구간은 두 구간 전의 반대쪽 평생선을 감싸고 지나가야 하기 때문
# 즉, 두 구간 전의 반대쪽 평행선보다 1칸 더 길어야 한다
# 두 구간을 같은 길이로 지나가고, 그 다음 구간은 그 이전보다 길어야 함
# 달팽이처럼 막히는 벽이 없으므로 스스로 길이를 세야 한다

예: 
  24 23 22 21 20
   9  8  7  6 19
  10  1  0  5 18
  11  2  3  4 17
  12 13 14 15 16
'''

def spiral_out(n):
    sdr, sdc = [0, 1, 0, -1], [-1, 0, 1, 0]     # 좌하우상, 서남동북 (반시계)
    r = c = n // 2      # 중앙에서 시작해야 하니까
    path = [(r, c)]     # 경로 기록
    d, length = 0, 1    # 방향, 길이
    # 0, 0까지 도달할 때까지 반복
    while (r, c) != (0, 0):
        for _ in range(2):              # 같은 길이로 두 번 반복
            for _ in range(length):
                r, c = r + sdr[d], c + sdc[d]
                path.append((r, c))
                if (r, c) == (0, 0):
                    break
            if (r, c) == (0, 0):
                break
            d = (d + 1) % 4     # 어디 부딪혀야 방향을 바꾸는 게 아니라, length만큼 직진한 뒤에 방향 변경
        length += 1
    return path