'''

[문제 요약]
택배 하차 알고리즘
N * N

1. 택배 투입(상 -> 하)
    - 택배는 직사각형 모양, 왼쪽 열 위치 c, w, h, 번호 k 가 주어짐
    - 중력에 의해 하단으로 떨어짐(상 -> 하, 즉 r만 N-1로 c는그대로) 
        -> 이거 그거네 아 근데 템플릿 한 번 해보고 기억이 안나는데 클났다
    - 바닥에 닿거나 내려가던 중 다른 짐을 만나면 거기서 멈춘다 
    - 택배 투입 완료 후, 어떤 택배들도 공간을 벗어나지 않음이 보장 (영역을 벗어나는 경우는 없다)
2. 택배 하차 (우->좌)
    - 왼쪽으로 이동했을 때 다른 택배와 부딪히지 않고 뺄 수 있는 택배를 먼저 하차 (왼쪽에 뭐가 없어야 함)
    - 그런 택배가 여러개면 k가 작은 택배 먼저
    - 택배 하차 후 공간이 남아있는 택배 중 떨어질 수 있는 건 떨어진다
        -> 즉, 1번에서 택배가 떨어지는 걸 함수화를 해두고 여기서도 활용을 해줘야겠네
3. 택배 하차 (좌 -> 우)
    - 2를 우측에서도 똑같이 진행

택배를 모두 하차할 때까지 2,3을 반복
하차되는 택배 번호 순서 출력
'''

import sys


# 택배 하나를 가장 밑으로 내리는 함수
def drop_box(k):
    h, w, r, c = boxes[k]

    # 먼저 자기 칸 지우기
    for x in range(r - h + 1, r + 1):
        for y in range(c, c + w):
            grid[x][y] = 0

    # 몇 칸 내려갈 건지
    dr_max = 0
    flag = False
    for dr in range(1, N-r):
        # 맨 왼쪽 칸부터 검증
        for i in range(c, c + w):
            nr = r + dr
            # 이미 택배가 있다면 이중 반복문 종료
            if grid[nr][i] > 0:
                flag = True
                dr -= 1
                break
        # 이번 dr이 가능하면 기록
        else: 
            dr_max = max(dr_max, dr)
        if flag:
            break
    
    # 최적의 dr을 기반으로 택배 위치 기록 (dr 더해서 내리기)
    for x in range(r - h + 1, r + 1):
        for y in range(c, c + w):
            grid[x + dr_max][y] = k

    boxes[k] = [h, w, r + dr_max, c]    # 세로, 가로, 맨 왼쪽 아래 좌표


def out_left():
    candidates = set()
    # 왼쪽에서부터 (0 -> N-1)
    for y in range(N):
        for x in range(N):
            if grid[x][y] == 0:     # 택배가 없는 경우는 넘기기
                continue
            if grid[x][y] in candidates:     # 이미 후보로 책정한 경우 넘기기
                continue

            # 택배가 있는 경우
            k = grid[x][y]
            h, w, r, c = boxes[k]
            # 행 돌면서 왼쪽이 다 비어있는지 판별 -> (r, c) 에서 h만큼 -1 하면서 반복
            # 근데 결국 왼쪽에 뭐가 있는지 본다라는 건.. 0 말고 다른 원소가 있다는 것
            for i in range(h):  # 행별로 왼쪽에 뭐가 있는지 판별
                nr, nc = r - i, c
                if sum(grid[nr][:nc]):  # 박스가 있는 경우
                    break
            else:   # 왼쪽에 아무것도 없는 경우, 후보에 넣기
                candidates.add(k)

    return min(candidates)


def out_right():
    candidates = set()
    # 오른쪽에서부터 (N-1 -> 0)
    for y in range(N - 1, -1, -1):
        for x in range(N):
            if grid[x][y] == 0:     # 택배가 없는 경우는 넘기기
                continue
            if grid[x][y] in candidates:     # 이미 후보로 책정한 경우 넘기기
                continue

            # 택배가 있는 경우
            k = grid[x][y]
            h, w, r, c = boxes[k]
            # 행 돌면서 오른쪽이 다 비어있는지 판별 -> (r, c) 에서 h만큼 -1 하면서 반복
            # 근데 결국 오른쪽에 뭐가 있는지 본다라는 건.. 0 말고 다른 원소가 있다는 것
            for i in range(h):  # 행별로 오른쪽에 뭐가 있는지 판별
                nr, nc = r - i, c + w - 1
                if sum(grid[nr][nc + 1:]):  # 박스가 있는 경우
                    break
            else:   # 오른쪽에 아무것도 없는 경우, 후보에 넣기
                candidates.add(k)

    return min(candidates)


# 격자 크기, 택배 개수
N, M = map(int, sys.stdin.readline().split())
grid = [[0] * N for _ in range(N)]
# boxes에 h, w, r, c를 저장. 이때 r, c는 좌측 하단 칸 좌표 (drop할 때 편할 듯)
boxes = dict()

# 1. 택배 입고
for _ in range(M):
    # k: 번호, h: 세로, w: 가로, c: 좌측 좌표 (= c)
    k, h, w, c = map(int, sys.stdin.readline().split())
    boxes[k] = [h, w, h-1, c-1]
    drop_box(k)
# 2. 택배 하차 (우 -> 좌 -> 우 -> 좌 -> ...)
for i in range(M):
    # 짝수 -> 좌 / 홀수 -> 우
    out_box = out_left() if i%2 == 0 else out_right()

    # 박스 하차
    h, w, r, c = boxes[out_box]
    for x in range(r - h + 1, r + 1):
        for y in range(c, c + w):
            grid[x][y] = 0
    del boxes[out_box]
    print(out_box)
    
    # 모든 택배에 대해서 drop 연산 실행
    # 개선: 순서 명시해서 순회하기 for kk in sorted(boxes, key=lambda k: -boxes[k][2]):
    #       택배 박스는 처음부터 순서대로 떨어지기 때문에, 택배가 하차한 뒤에도 들어온 순서대로 낙하 시켜야 한다
    for kk in boxes.keys():
        drop_box(kk)

'''
[메모]
흠 일단 직사각형이니까 모든 원소를 저장해서 관리할 필요는 없겠다

근데 예제를 보니까 왼, 오, 왼, 오 순서대로 하네
즉, 왼쪽에서 가장 빨리 나갈 애 선정 -> 좌 하차 -> drop -> 오른쪽에서 나갈 애 선정 -> 우 하차 -> drop -> 왼쪽에서 ...
최소힙으로 상태를 관리하기엔 애매한 것 같다 왜냐면 정렬 조건이 계속 바뀌는 셈이라서
그러면 먼저 하차할 택배를 선정하는 로직을 고민해 봐야겠는데 어떻게 할 수 있을까

여기서 고려해봐야할 점은 박스의 크기가 직사각형이긴 하지만, 그 세로가 제각각이기 때문에
택배가 나가려면 그 세로의 길이만큼 좌/우가 비어 있어야 한다는 점이다

지금 상태에서는 초기에 drop 해서 grid에 값을 넣는 거 말고는 다른 변수를 쓰고 있지 않아
그러면 grid만으로 좌 / 우 에서 바로 나갈 애를 찾을 수 있나? 완전탐색으로?
단순하게 생각해보자
좌의 경로를 먼저 생각해보면... c가 0인 경우부터 탐색해
for c in ..:
    for r in ..:   
        만약 0 이 아니라 택배가 있다면?
        먼저 그 택배의 h 파악 (r을 계속 더하다가 그 다음이 다른 값이면 끝)
        왼쪽이 다 비어있는지 판별
        h만큼 반복해서 c-1 해가면서 직접 찾아보기
        만약 for문이 break 없이 끝나면 후보에 추가

마지막에 후보 비교해서 최소인 거 빼기 (grid 내 좌표 0으로 만들기)
택배 위치를 별도로 상태관리하는 방법도 있긴 하겠지만 경험상.. 유지보수가 너무 힘들어져서
상태 관리를 안해도 되는 거면 안하게 하고싶다

근데 여기서 문제가 있네 내가 기존에 짠 drop_box는 k, h, w, c를 다 받는데 여기서 재활용 하려니까
어떻게 해야할지 답이 없네
그럼 맨 처음에 택배를 dict 로 받아서 해볼까? 하차한 택배는 del 로 지우고? 
근데 그러면 결국 상태 관리를 추가하게 되는 건데... 흠... 함수화를 잘해두면 괜찮을 것 같다

일단 하차는 어느정도 됐고.. 근데 입고를 생각을 안했네
# k: 번호, h: 세로, w: 가로, c: 좌측 좌표 (= c)
def drop_box(k, h, w, c)

일단 맨 처음 위치는 정해진다 (0, c) ~ (h, c+w) 를 양끝점으로 하는 직사각형
이건 중력에 따라 쏠리는 테트리스 뭐 그런 템플릿이랑 비슷하다. 근데 제약사항이 있다면..
가로 크기가 있기 때문에 아래에 장애물이 있다면 거기에 막힌다는 것.
즉, N이 5이고 (0, 0) ~ (1, 2)인 걸 추가한다 치자
아래에 (4, 1) 한칸짜리가 밑에 있다고 치자
그러면 (4,0) ~ (4,2)가 아니라 (3,0) ~ (3,2)가 되어야 함
즉 밑에 가장 가까이에 있는 벽이나 장애물 위치를 보고 dr을 정해야 한다는 것
밑으로 내릴 때는 c는 바뀔 필요 없다

그러면 함수 내부 로직은
1. for dr in range(N-1, 0, -1) 으로 순회하기
    for rr in range(r, r+w+1)
        # 칸에 dr을 더해봤을 때 0이면 넘어가고, 장애물이 있으면 
    else # 장애물이 없고, 내려갈 수 있는 최대의 dr
        -> break
2. dr이 나오면 dr만큼 내려간 위치에 모든 원소 기록

1-index로 문제 제공, 0-index로 바꿔야 함 (c만 바꾸면 됨)

[회고]

와.. 2시간 40분 정도만에 다 풀었다!! 근데 걱정인 건 코드트리가 테스트케이스를 보여주는 편이라서.. 실전에서 이런 방식이 아니면 어떡하지?

그래도 칭찬할 점은!
1. 스스로 힘으로 코드트리 안에서 다 풀었다
2. 지난 번에 풀 때 함수화가 어려웠는데, 이번에 풀 때는 전보다는 함수를 잘 활용했다
3. 테스트케이스 기반으로 디버깅을 잘 해냈다
4. 택배 기준점을 문제에 맞게 왼쪽 아래로 고른 게 현명했던 것 같다. 아래로 떨어질 때 확인해야 하는 게 바닥 줄이니까.

근데 아쉬웠던 건 직접 반례나 엣지케이스, 경계 쪽을 생각하지 않고 코드트리가 제공하는 테스트케이스에 의존했다는 점이다
다음에 문제를 풀 때는 직접 그 경계를 코드가 잘 처리하는지를 스스로 잘 생각해 봐야겠다
    -> 경계에 닿으면? 아무 일도 안 일어나면? 실패하면? 모양이 특이하면? 연쇄로 일어나면? 동률이면? 처럼 각 질문에 내 코드의 어느 줄이 처리하는 지를 확인해보자

주요 디버깅 과정:
1. drop_box() 로직에 버그가 있음
    좌, 우 탐색할 때처럼 밑을 탐색해야 하는데 그냥 특정 좌표만 탐색하니까
    중간에 막히는 데가 있어도 밑에가 그 모양대로 뚫려있으면 그냥 내려가게 됨
    그러면 탐색 방향을 바꿔서 0부터 하게 해야겠다
    이걸 바꾸는 과정에서도 여러 이슈가 있었는데.. 먼저 택배가 있는 경우 flag로 탐색을 종료하는데 이때는 dr을 그대로 넘기는 게 아니라 1을 빼주어야 했음
    
2. drop_box() 에서 N = h처럼 처음 입고됐을 때 상태 그대로(r=0) 있는 경우를 처리 못했음
    기존에 drop_box()에서 grid에 쓰기를 할 때는 그냥 dr_max > 0이었음. 근데 이러니까 dr_max가 0인 케이스를 처리 못함
    그래서 N = h인 경우가 boxes 에는 있는데 grid 안에 없는 문제가 생겼음

    그래서 케이스를 나눠서 조건문에 따라서 처리를 함
    근데 이것도 처음에 잘못해서 # 처음 쓰이는 경우 -> 쓰기만 를 dr_max == 0 이라는 조건을 넣어버려서 처음 쓰일 때 N =h인 경우만 잘 쓰이고
    나머지는 못 쓰이는 버그가 있었음

    => 이건 추후에 그냥 조건 분기 안하고, 먼저 자기 칸 지우기 -> 몇 칸 내려갈 건지 찾기 -> 쓰기 순으로 진행하도록 수정함
        경우를 나눠 처리하면 버그가 생기기 쉬운 것 같다. 항상 그냥 같은 순서로 처리하게 해서 분기를 없애보는 방향으로 해봐야겠다

3. out_left(), out_right() 에 r, c 지역변수를 잘못 쓴 경우
    이번에는 전체적으로 택배의 왼쪽 아래 좌표를 r, c로 썼음. 근데 두 함수 내부에서 그리드 내부를 순회할 때 x, y를 쓰지 않고 습관대로 r, c를 써버린 것
    마지막에 이 문제를 발견해서 다행히 통과!

4. 보통은 r, c의 위치를 직사각형의 왼쪽 위 끝 점으로 했겠지만 이번에는 아래 쪽으로 (N과 가까운 쪽으로) 얼마나 빈 공간이 있는지를 탐색해야 해서
    일부러 왼족 아래 끝 점으로 했다. 그래서 h, w, r, c를 기반으로 직사각형 범위를 측정할 때 좀 헷갈리긴 했지만 그래도 종이에 열심히 그려가며 성공적으로 로직을 짰다.
    비록 중간에 가끔 틀려서 어지러웠지만..
    다음에는 기준점처럼 오래 쓰는 값을 평소에 쓰는 것과 다르게 따로 이름을 지어보는 것도 좋을 것 같다. 예를 들어 br, bc로 하고 r, c는 반복문 전용으로 두듯이!
'''